``` Terraform will perform the following actions:

  # aws_route53_record.mq02-server will be updated in-place
  ~ resource "aws_route53_record" "mq02-server" {
        id              = "Z386N8B8JBC6TQ_mq02.galaxyproject.eu_A"
        name            = "mq02.galaxyproject.eu"
      ~ records         = [
          + "10.4.68.197",
          - "10.5.68.232",
        ]
        # (5 unchanged attributes hidden)
    }

  # openstack_networking_secgroup_rule_v2.interactive-egress-internal-network will be created
  + resource "openstack_networking_secgroup_rule_v2" "interactive-egress-internal-network" {
      + direction         = "egress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "10.0.0.0/8"
      + security_group_id = "2df98248-0b6a-4763-90a8-e77a859d2457"
      + tenant_id         = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```